Repository: thisisrownak/QR_Restaurant
Catalog: QR_Restaurant.UI/Resources/ValidationResource.*.resx
Languages: ar, de, es, fr, hi, it, pl, pt, ru, tr, zh

# Address
source: Please enter address.
ar: الرجاء إدخال العنوان.
de: Bitte geben Sie die Adresse ein.
es: Ingrese la dirección.
fr: Veuillez saisir une adresse.
hi: कृपया पता दर्ज करें।
it: Si prega di inserire l'indirizzo.
pl: Proszę podać adres.
pt: Insira o endereço.
ru: Пожалуйста, введите адрес.
tr: Lütfen adres girin.
zh: 请输入地址。

# Email
source: Please enter Email.
ar: الرجاء إدخال البريد الإلكتروني.
de: Bitte geben Sie E-Mail ein.
es: Introduzca su correo electrónico.
fr: Veuillez saisir un e-mail.
hi: कृपया ईमेल दर्ज करें।
it: Inserisci l'email.
pl: Wprowadź adres e-mail.
pt: Por favor, insira o email.
ru: Пожалуйста, введите адрес электронной почты.
tr: Lütfen e-posta giriniz.
zh: 请输入电子邮件。

# EmailFormat
source: You did not enter an email address in the correct format.
ar: لم تدخل عنوان بريد إلكتروني بالتنسيق الصحيح.
de: Sie haben keine E-Mail-Adresse im richtigen Format eingegeben.
es: No ingresó una dirección de correo electrónico en el formato correcto.
fr: Vous n'avez pas entré une adresse e-mail au format correct.
hi: आपने सही प्रारूप में एक ईमेल पता दर्ज नहीं किया।
it: Non hai inserito un indirizzo email nel formato corretto.
pl: Nie podałeś adresu e-mail w poprawnym formacie.
pt: Você não inseriu um endereço de e-mail no formato correto.
ru: Вы ввели адрес электронной почты в неправильном формате.
tr: Doğru biçimde bir e-posta adresi girmediniz.
zh: 您输入的电子邮件地址格式不正确。

# EmailMaxLength
source: E-mail address should not exceed 200 characters.
ar: يجب ألا يتجاوز عنوان البريد الإلكتروني 200 حرف.
de: Die E-Mail-Adresse sollte 200 Zeichen nicht überschreiten.
es: La dirección de correo electrónico no debe exceder los 200 caracteres.
fr: L'adresse e-mail ne doit pas dépasser 200 caractères.
hi: ई-मेल पता 200 अक्षरों से अधिक नहीं होना चाहिए।
it: L'indirizzo e-mail non deve superare i 200 caratteri.
pl: Adres e-mail nie powinien przekraczać 200 znaków.
pt: O endereço de e-mail não deve exceder 200 caracteres.
ru: Адрес электронной почты не должен превышать 200 символов.
tr: E-posta adresi 200 karakteri geçmemelidir.
zh: 电子邮件地址不得超过200个字符。

# Exists
source: There is a record in the database with one of the entered fields.
ar: يوجد سجل في قاعدة البيانات مع أحد الحقول التي تم إدخالها.
de: Es gibt einen Datensatz in der Datenbank mit einem der eingegebenen Felder.
es: Hay un registro en la base de datos con uno de los campos ingresados.
fr: Il existe un enregistrement dans la base de données avec l'un des champs saisis.
hi: दर्ज किए गए फ़ील्ड में से एक के साथ डेटाबेस में एक रिकॉर्ड है।
it: C'è un record nel database con uno dei campi inseriti.
pl: W bazie danych znajduje się rekord z jednym z wprowadzonych pól.
pt: Existe um registro no banco de dados com um dos campos inseridos.
ru: В базе есть запись с одним из введенных полей.
tr: Girilen alanlardan birisi ile veritabanında kayıt mevcuttur.
zh: 数据库中有一条记录，其中包含输入的字段之一。

# ImageControl
source: The file you uploaded must be an image file and should not exceed 6MB.
ar: يجب أن يكون الملف الذي قمت بتحميله ملف صورة ويجب ألا يتجاوز 6 ميجا بايت.
de: Die von Ihnen hochgeladene Datei muss eine Bilddatei sein und darf 6 MB nicht überschreiten.
es: El archivo que cargó debe ser un archivo de imagen y no debe exceder los 6 MB.
fr: Le fichier que vous avez téléchargé doit être un fichier image et ne doit pas dépasser 6 Mo.
hi: आपके द्वारा अपलोड की गई फ़ाइल एक छवि फ़ाइल होनी चाहिए और 6MB से अधिक नहीं होनी चाहिए।
it: Il file che hai caricato deve essere un file immagine e non deve superare i 6 MB.
pl: Przesłany plik musi być plikiem graficznym i nie powinien przekraczać 6 MB.
pt: O arquivo carregado deve ser um arquivo de imagem e não deve exceder 6 MB.
ru: Загруженный файл должен быть файлом изображения и не должен превышать 6 МБ.
tr: Yüklediğiniz dosya bir resim dosyası olmalı ve 6MB’yi geçmemelidir.
zh: 您上传的文件必须是图像文件，并且不能超过6MB。

# MaxAddress
source: Address must not exceed 200 characters.
ar: يجب ألا يتجاوز العنوان 200 حرف.
de: Die Adresse darf 200 Zeichen nicht überschreiten.
es: La dirección no debe superar los 200 caracteres.
fr: L'adresse ne doit pas dépasser 200 caractères.
hi: पता 200 अक्षरों से अधिक नहीं होना चाहिए।
it: L'indirizzo non deve superare i 200 caratteri.
pl: Adres nie może przekraczać 200 znaków.
pt: O endereço não deve exceder 200 caracteres.
ru: Адрес не должен превышать 200 символов.
tr: Adres 200 karakteri geçmemelidir.
zh: 地址不得超过200个字符。

# MaxInt
source: Number value is greater than it should be.
ar: قيمة الرقم أكبر مما ينبغي.
de: Der Zahlenwert ist größer als er sein sollte.
es: El valor numérico es mayor de lo que debería ser.
fr: La valeur numérique est supérieure à ce qu'elle devrait être.
hi: संख्या मान जितना होना चाहिए, उससे अधिक है।
it: Il valore del numero è maggiore di quanto dovrebbe essere.
pl: Wartość liczbowa jest większa niż powinna.
pt: O valor do número é maior do que deveria ser.
ru: Числовое значение больше, чем должно быть.
tr: Sayı değeri olması gerekenden daha büyük.
zh: 数字值大于应有的值。

# MaxLength
source: The maximum number of characters for the field has been exceeded.
ar: تم تجاوز الحد الأقصى لعدد الأحرف للحقل.
de: Die maximale Anzahl von Zeichen für das Feld wurde überschritten.
es: Se superó el número máximo de caracteres para el campo.
fr: Le nombre maximum de caractères pour le champ a été dépassé.
hi: क्षेत्र के लिए वर्णों की अधिकतम संख्या पार हो गई है।
it: È stato superato il numero massimo di caratteri per il campo.
pl: Przekroczono maksymalną liczbę znaków w polu.
pt: O número máximo de caracteres para o campo foi excedido.
ru: Превышено максимальное количество символов для поля.
tr: Alan için maksimum karakter sayısı aşıldı.
zh: 超过了该字段的最大字符数。

# MaxManagerName
source: Name should not exceed 50 characters.
ar: يجب ألا يتجاوز الاسم 50 حرفًا.
de: Der Name sollte 50 Zeichen nicht überschreiten.
es: El nombre no debe exceder los 50 caracteres.
fr: Le nom ne doit pas dépasser 50 caractères.
hi: नाम 50 अक्षरों से अधिक नहीं होना चाहिए।
it: Il nome non deve superare i 50 caratteri.
pl: Nazwa nie powinna przekraczać 50 znaków.
pt: O nome não deve ter mais de 50 caracteres.
ru: Имя не должно превышать 50 символов.
tr: İsim 50 karakteri geçmemelidir.
zh: 名称不得超过50个字符。

# MaxPhone
source: Phone number must not exceed 15 characters.
ar: يجب ألا يتجاوز رقم الهاتف 15 حرفًا.
de: Die Telefonnummer darf 15 Zeichen nicht überschreiten.
es: El número de teléfono no debe superar los 15 caracteres.
fr: Le numéro de téléphone ne doit pas dépasser 15 caractères.
hi: फ़ोन नंबर 15 वर्णों से अधिक नहीं होना चाहिए।
it: Il numero di telefono non deve superare i 15 caratteri.
pl: Numer telefonu nie może przekraczać 15 znaków.
pt: O número de telefone não deve ter mais de 15 caracteres.
ru: Номер телефона не должен превышать 15 символов.
tr: Telefon numarası 15 karakteri geçmemelidir.
zh: 电话号码不得超过15个字符。

# MaxRestaurantDescription
source: Description must not exceed 1000 characters.
ar: يجب ألا يتجاوز الوصف 1000 حرف.
de: Die Beschreibung darf 1000 Zeichen nicht überschreiten.
es: La descripción no debe superar los 1000 caracteres.
fr: La description ne doit pas dépasser 1 000 caractères.
hi: विवरण 1000 वर्णों से अधिक नहीं होना चाहिए।
it: La descrizione non deve superare i 1000 caratteri.
pl: Opis nie może przekraczać 1000 znaków.
pt: A descrição não deve exceder 1000 caracteres.
ru: Описание не должно превышать 1000 символов.
tr: Açıklama 1000 karakteri geçmemelidir.
zh: 说明不得超过1000个字符。

# MaxRestaurantName
source: Restaurant name should not exceed 150 characters.
ar: يجب ألا يتجاوز اسم المطعم 150 حرفًا.
de: Der Name des Restaurants sollte 150 Zeichen nicht überschreiten.
es: El nombre del restaurante no debe superar los 150 caracteres.
fr: Le nom du restaurant ne doit pas dépasser 150 caractères.
hi: रेस्तरां का नाम 150 अक्षरों से अधिक नहीं होना चाहिए।
it: Il nome del ristorante non deve superare i 150 caratteri.
pl: Nazwa restauracji nie powinna przekraczać 150 znaków.
pt: O nome do restaurante não deve exceder 150 caracteres.
ru: Название ресторана не должно превышать 150 символов.
tr: Restoran adı 150 karakteri geçmemelidir.
zh: 餐厅名称不得超过150个字符。

# MaxSurname
source: Surname should not exceed 70 characters.
ar: يجب ألا يتجاوز اللقب 70 حرفًا.
de: Der Nachname sollte 70 Zeichen nicht überschreiten.
es: El apellido no debe exceder los 70 caracteres.
fr: Le nom de famille ne doit pas dépasser 70 caractères.
hi: उपनाम 70 अक्षरों से अधिक नहीं होना चाहिए।
it: Il cognome non deve superare i 70 caratteri.
pl: Nazwisko nie powinno przekraczać 70 znaków.
pt: O sobrenome não deve exceder 70 caracteres.
ru: Фамилия не должна превышать 70 символов.
tr: Soyadı 70 karakteri geçmemelidir.
zh: 姓氏不能超过70个字符。

# MaxTableName
source: Table name must not exceed 500 characters.
ar: يجب ألا يتجاوز اسم الجدول 500 حرف.
de: Der Tabellenname darf 500 Zeichen nicht überschreiten.
es: El nombre de la tabla no debe superar los 500 caracteres.
fr: Le nom de la table ne doit pas dépasser 500 caractères.
hi: तालिका का नाम 500 वर्णों से अधिक नहीं होना चाहिए।
it: Il nome della tabella non deve superare i 500 caratteri.
pl: Nazwa tabeli nie może przekraczać 500 znaków.
pt: O nome da tabela não deve exceder 500 caracteres.
ru: Имя таблицы не должно превышать 500 символов.
tr: Tablo adı 500 karakteri geçmemelidir.
zh: 表格名称不得超过500个字符。

# MaxTableNo
source: Table name must not exceed 10000 characters.
ar: يجب ألا يتجاوز اسم الجدول 10000 حرف.
de: Der Tabellenname darf 10000 Zeichen nicht überschreiten.
es: El nombre de la tabla no debe superar los 10000 caracteres.
fr: Le nom de la table ne doit pas dépasser 10 000 caractères.
hi: तालिका का नाम 10000 वर्णों से अधिक नहीं होना चाहिए।
it: Il nome della tabella non deve superare i 10000 caratteri.
pl: Nazwa tabeli nie może przekraczać 10000 znaków.
pt: O nome da tabela não deve exceder 10.000 caracteres.
ru: Имя таблицы не должно превышать 10000 символов.
tr: Tablo adı 10000 karakteri geçmemelidir.
zh: 表格名称不得超过10000个字符。

# MinInt
source: Number must be greater than zero.
ar: يجب أن يكون الرقم أكبر من الصفر.
de: Die Zahl muss größer als Null sein.
es: El número debe ser mayor que cero.
fr: Le nombre doit être supérieur à zéro.
hi: संख्या शून्य से अधिक होनी चाहिए।
it: Il numero deve essere maggiore di zero.
pl: Liczba musi być większa od zera.
pt: O número deve ser maior que zero.
ru: Число должно быть больше нуля.
tr: Sayı sıfırdan büyük olmalıdır.
zh: 数字必须大于零。

# MinTableNo
source: Table number must be greater than 0.
ar: يجب أن يكون رقم الجدول أكبر من 0.
de: Die Tabellennummer muss größer als 0 sein.
es: El número de la tabla debe ser mayor que 0.
fr: Le numéro de table doit être supérieur à 0.
hi: तालिका संख्या 0 से अधिक होनी चाहिए।
it: Il numero di tabella deve essere maggiore di 0.
pl: Numer tabeli musi być większy niż 0.
pt: O número da mesa deve ser maior que 0.
ru: Номер таблицы должен быть больше 0.
tr: Tablo numarası 0'dan büyük olmalıdır.
zh: 表号必须大于0。

# Name
source: Please enter name.
ar: الرجاء إدخال الاسم.
de: Bitte geben Sie den Namen ein.
es: Ingrese su nombre.
fr: Veuillez entrer le nom.
hi: कृपया नाम दर्ज करें।
it: Inserisci il nome.
pl: Proszę podać imię i nazwisko.
pt: Por favor insira o nome.
ru: Пожалуйста, введите имя.
tr: Lütfen isim giriniz.
zh: 请输入姓名。

# NewPassword
source: Please enter your new password.
ar: الرجاء إدخال كلمة المرور الجديدة الخاصة بك.
de: Bitte geben Sie Ihr neues Passwort ein.
es: Ingrese su nueva contraseña.
fr: Veuillez saisir votre nouveau mot de passe.
hi: कृपया अपना नया पासवर्ड दर्ज करें।
it: Inserisci la tua nuova password.
pl: Wprowadź nowe hasło.
pt: Por favor, digite sua nova senha.
ru: Пожалуйста, введите ваш новый пароль.
tr: Lütfen yeni şifrenizi girin.
zh: 请输入新密码。

# NotEmpty
source: Please fill in the field.
ar: الرجاء ملء الحقل.
de: Bitte füllen Sie das Feld aus.
es: Por favor complete el campo.
fr: Veuillez remplir le champ.
hi: कृपया मैदान में भरें।
it: Si prega di compilare il campo.
pl: Proszę wypełnić pole.
pt: Por favor, preencha o campo.
ru: Пожалуйста, заполните поле.
tr: Lütfen alanı doldurunuz.
zh: 请填写该字段。

# NumberFormat
source: The field should consist of numbers.
ar: يجب أن يتكون الحقل من أرقام.
de: Das Feld sollte aus Zahlen bestehen.
es: El campo debe constar de números.
fr: Le champ doit être composé de nombres.
hi: फ़ील्ड में संख्याओं से युक्त होना चाहिए।
it: Il campo dovrebbe essere composto da numeri.
pl: Pole powinno zawierać liczby.
pt: O campo deve consistir em números.
ru: Поле должно состоять из цифр.
tr: Alan sayılardan oluşmalıdır.
zh: 该字段应包含数字。

# Password
source: Please enter password.
ar: الرجاء إدخال كلمة المرور.
de: Bitte Passwort eingeben.
es: Por favor, ingrese contraseña.
fr: Veuillez entrer le mot de passe.
hi: कृप्या पास्वर्ड भरो।
it: Per favore, inserisci la password.
pl: Proszę wpisać hasło.
pt: Por favor, digite a senha.
ru: Пожалуйста введите пароль.
tr: Lütfen şifre giriniz.
zh: 请输入密码。

# PasswordAgain
source: Password repeat is not correct.
ar: تكرار كلمة المرور غير صحيح.
de: Passwortwiederholung ist nicht korrekt.
es: La repetición de la contraseña no es correcta.
fr: La répétition du mot de passe n'est pas correcte.
hi: पासवर्ड रिपीट करना सही नहीं है।
it: La ripetizione della password non è corretta.
pl: Powtarzanie hasła jest nieprawidłowe.
pt: A repetição da senha não está correta.
ru: Повтор пароля неверен.
tr: Parola tekrarı doğru değil.
zh: 密码重复不正确。

# PasswordMaxChar
source: Your password must not exceed 35 characters.
ar: يجب ألا تتجاوز كلمة مرورك 35 حرفًا.
de: Ihr Passwort darf 35 Zeichen nicht überschreiten.
es: Su contraseña no debe exceder los 35 caracteres.
fr: Votre mot de passe ne doit pas dépasser 35 caractères.
hi: आपका पासवर्ड 35 वर्णों से अधिक नहीं होना चाहिए।
it: La tua password non deve superare i 35 caratteri.
pl: Twoje hasło nie może przekraczać 35 znaków.
pt: Sua senha não deve exceder 35 caracteres.
ru: Ваш пароль не должен превышать 35 символов.
tr: Şifreniz 35 karakteri geçmemelidir.
zh: 您的密码不能超过35个字符。

# PasswordMinChar
source: Your password must be at least 6 characters.
ar: يجب أن تتكون كلمة المرور الخاصة بك من 6 أحرف على الأقل.
de: Ihr Passwort muss mindestens 6 Zeichen lang sein.
es: Su contraseña debe tener al menos 6 caracteres.
fr: Votre mot de passe doit comporter au moins 6 caractères.
hi: आपका पासवर्ड कम से कम 6 अक्षर का होना चाहिए।
it: La tua password deve contenere almeno 6 caratteri.
pl: Twoje hasło musi mieć co najmniej 6 znaków.
pt: Sua senha deve ter pelo menos 6 caracteres.
ru: Ваш пароль должен содержать не менее 6 символов.
tr: Şifreniz en az 6 karakter olmalıdır.
zh: 您的密码必须至少包含6个字符。

# Phone
source: Please enter phone number.
ar: الرجاء إدخال رقم الهاتف.
de: Bitte geben Sie die Telefonnummer ein.
es: Ingrese el número de teléfono.
fr: Veuillez entrer le numéro de téléphone.
hi: कृपया फ़ोन नंबर दर्ज करें।
it: Si prega di inserire il numero di telefono.
pl: Proszę podać numer telefonu.
pt: Insira o número do telefone.
ru: Пожалуйста, введите номер телефона.
tr: Lütfen telefon numarasını giriniz.
zh: 请输入电话号码。

# RestaurantDescription
source: Please enter description.
ar: الرجاء إدخال الوصف.
de: Bitte geben Sie eine Beschreibung ein.
es: Introduzca una descripción.
fr: Veuillez saisir une description.
hi: कृपया विवरण दर्ज करें।
it: Si prega di inserire la descrizione.
pl: Proszę podać opis.
pt: Insira a descrição.
ru: Пожалуйста, введите описание.
tr: Lütfen açıklama girin.
zh: 请输入描述。

# RestaurantName
source: Please enter restaurant name.
ar: الرجاء إدخال اسم المطعم.
de: Bitte geben Sie den Namen des Restaurants ein.
es: Ingrese el nombre del restaurante.
fr: Veuillez saisir le nom du restaurant.
hi: कृपया रेस्तरां का नाम दर्ज करें।
it: Inserisci il nome del ristorante.
pl: Wpisz nazwę restauracji.
pt: Insira o nome do restaurante.
ru: Пожалуйста, введите название ресторана.
tr: Lütfen restoran adını girin.
zh: 请输入餐厅名称。

# RestaurantPhone
source: Please enter phone number.
ar: الرجاء إدخال رقم الهاتف.
de: Bitte geben Sie die Telefonnummer ein.
es: Ingrese el número de teléfono.
fr: Veuillez entrer le numéro de téléphone.
hi: कृपया फ़ोन नंबर दर्ज करें।
it: Inserisci il numero di telefono.
pl: Proszę podać numer telefonu.
pt: Insira o número do telefone.
ru: Пожалуйста, введите номер телефона.
tr: Lütfen telefon numarasını giriniz.
zh: 请输入电话号码。

# StartEndDate
source: The end date must be later than the start date.
ar: يجب أن يأتي تاريخ الانتهاء بعد تاريخ البدء.
de: Das Enddatum muss nach dem Startdatum liegen.
es: La fecha de finalización debe ser posterior a la fecha de inicio.
fr: La date de fin doit être postérieure à la date de début.
hi: अंतिम तिथि प्रारंभ तिथि से बाद में होनी चाहिए।
it: La data di fine deve essere successiva alla data di inizio.
pl: Data zakończenia musi być późniejsza niż data rozpoczęcia.
pt: A data de término deve ser posterior à data de início.
ru: Дата окончания должна быть позже даты начала.
tr: Bitiş tarihi, başlangıç ​​tarihinden sonra olmalıdır.
zh: 结束日期必须晚于开始日期。

# Surname
source: Please enter surname.
ar: الرجاء إدخال اللقب.
de: Bitte geben Sie den Nachnamen ein.
es: Ingrese el apellido.
fr: Veuillez saisir le nom de famille.
hi: कृपया उपनाम दर्ज करें।
it: Si prega di inserire il cognome.
pl: Proszę podać nazwisko.
pt: Por favor, insira o sobrenome.
ru: Пожалуйста, введите фамилию.
tr: Lütfen soyadınızı giriniz.
zh: 请输入姓氏。

# TableName
source: Please enter table name.
ar: الرجاء إدخال اسم الجدول.
de: Bitte geben Sie den Tabellennamen ein.
es: Introduzca el nombre de la tabla.
fr: Veuillez saisir le nom de la table.
hi: कृपया तालिका नाम दर्ज करें।
it: Inserisci il nome della tabella.
pl: Proszę podać nazwę tabeli.
pt: Insira o nome da tabela.
ru: Пожалуйста, введите название таблицы.
tr: Lütfen tablo adını girin.
zh: 请输入表格名称。

# TableNo
source: Please enter table no.
ar: الرجاء إدخال الجدول رقم.
de: Bitte geben Sie Tabelle Nr.
es: Por favor ingrese la tabla no.
fr: Veuillez saisir le n ° du tableau.
hi: कृपया तालिका सं।
it: Si prega di inserire la tabella n.
pl: Proszę podać nr tabeli
pt: Insira o número da tabela
ru: Пожалуйста, введите номер таблицы.
tr: Lütfen tablo numarasını girin.
zh: 请输入表号

# TableNoFormat
source: The table number should consist of numbers.
ar: يجب أن يتكون رقم الجدول من أرقام.
de: Die Tabellennummer sollte aus Zahlen bestehen.
es: El número de la tabla debe constar de números.
fr: Le numéro de la table doit être composé de nombres.
hi: तालिका संख्या में संख्याएँ होनी चाहिए।
it: Il numero della tabella dovrebbe essere composto da numeri.
pl: Numer tabeli powinien składać się z liczb.
pt: O número da mesa deve consistir em números.
ru: Номер таблицы должен состоять из цифр.
tr: Tablo numarası sayılardan oluşmalıdır.
zh: 表号应包含数字。

# UniqueEmail
source: A previously registered Email.
ar: بريد إلكتروني مسجل مسبقًا.
de: Eine zuvor registrierte E-Mail.
es: Un correo electrónico registrado previamente.
fr: Un e-mail précédemment enregistré.
hi: पहले से पंजीकृत ईमेल।
it: Un'e-mail registrata in precedenza.
pl: Wcześniej zarejestrowany adres e-mail.
pt: Um e-mail registrado anteriormente.
ru: Ранее зарегистрированный адрес электронной почты.
tr: Önceden kaydedilmiş bir E-posta.
zh: 先前注册的电子邮件。

# UniqueUrl
source: Url is being used. Try different.
ar: يتم استخدام عنوان Url. حاول بطريقة مختلفة.
de: URL wird verwendet. Versuchen Sie es anders.
es: Se está utilizando la URL. Prueba diferentes.
fr: L'URL est utilisée. Essayez différent.
hi: Url का उपयोग किया जा रहा है। अलग कोशिश करो।
it: Url è in uso. Prova diverso.
pl: Adres URL jest używany. Spróbuj inaczej.
pt: Url está sendo usado. Experimente diferente.
ru: URL используется. Попробуйте разные.
tr: URL kullanılıyor. Farklı deneyin.
zh: 正在使用网址。尝试不同。

# UniqueUsername
source: Username is available, try a different name.
ar: اسم المستخدم متاح ، جرب اسمًا مختلفًا.
de: Benutzername ist verfügbar, versuchen Sie einen anderen Namen.
es: El nombre de usuario está disponible, pruebe con otro nombre.
fr: Le nom d'utilisateur est disponible, essayez un autre nom.
hi: उपयोगकर्ता नाम उपलब्ध है, एक अलग नाम का प्रयास करें।
it: Il nome utente è disponibile, prova con un nome diverso.
pl: Nazwa użytkownika jest dostępna, użyj innej nazwy.
pt: O nome de usuário está disponível, tente um nome diferente.
ru: Имя пользователя доступно, попробуйте другое имя.
tr: Kullanıcı adı kullanılıyor, farklı bir ad deneyin.
zh: 用户名可用，请尝试使用其他名称。

# Url
source: Enter unique url.
ar: أدخل عنوان url فريدًا.
de: Geben Sie eine eindeutige URL ein.
es: Ingrese una URL única.
fr: Saisissez une URL unique.
hi: अद्वितीय url दर्ज करें।
it: Inserisci un URL univoco.
pl: Wpisz unikalny adres URL.
pt: Insira um url exclusivo.
ru: Введите уникальный URL.
tr: Url başkası tarafından kullanılıyor. Farkı bir url girin.
zh: 输入唯一的网址。

# Username
source: Please enter username.
ar: الرجاء إدخال اسم المستخدم.
de: Bitte geben sie einen Benutzernamen ein.
es: Ingrese el nombre de usuario.
fr: Veuillez saisir votre nom d'utilisateur.
hi: कृपया उपयोगकर्ता नाम दर्ज करें।
it: Inserisci il nome utente.
pl: Proszę podać nazwę użytkownika.
pt: Por favor, insira o nome de usuário.
ru: Пожалуйста, введите имя пользователя.
tr: Lütfen kullanıcı adını girin.
zh: 请输入用户名。

# UsernameMaxLength
source: Username must not exceed 40 characters.
ar: يجب ألا يتجاوز اسم المستخدم 40 حرفًا.
de: Der Benutzername darf 40 Zeichen nicht überschreiten.
es: El nombre de usuario no debe superar los 40 caracteres.
fr: Le nom d'utilisateur ne doit pas dépasser 40 caractères.
hi: उपयोगकर्ता नाम 40 वर्णों से अधिक नहीं होना चाहिए।
it: Il nome utente non deve superare i 40 caratteri.
pl: Nazwa użytkownika nie może przekraczać 40 znaków.
pt: O nome de usuário não deve exceder 40 caracteres.
ru: Имя пользователя не должно превышать 40 символов.
tr: Kullanıcı adı 40 karakteri geçmemelidir.
zh: 用户名不能超过40个字符。

# ValidPassword
source: Your password cannot contain spaces.
ar: كلمة المرور الخاصة بك لا يمكن أن تحتوي على مسافات.
de: Ihr Passwort darf keine Leerzeichen enthalten.
es: Tu contraseña no puede contener espacios.
fr: Votre mot de passe ne peut pas contenir d'espaces.
hi: आपके पासवर्ड में स्थान नहीं हो सकते।
it: La tua password non può contenere spazi.
pl: Twoje hasło nie może zawierać spacji.
pt: Sua senha não pode conter espaços.
ru: Ваш пароль не может содержать пробелов.
tr: Parolanız boşluk içeremez.
zh: 您的密码不能包含空格。

# ValidUsername
source: Username cannot contain spaces, special characters.
ar: اسم المستخدم لا يمكن أن يحتوي على مسافات ، رموز خاصة.
de: Der Benutzername darf keine Leerzeichen oder Sonderzeichen enthalten.
es: El nombre de usuario no puede contener espacios, caracteres especiales.
fr: Le nom d'utilisateur ne peut pas contenir d'espaces, de caractères spéciaux.
hi: उपयोगकर्ता नाम में स्थान, विशेष वर्ण नहीं हो सकते।
it: Il nome utente non può contenere spazi, caratteri speciali.
pl: Nazwa użytkownika nie może zawierać spacji ani znaków specjalnych.
pt: O nome de usuário não pode conter espaços, caracteres especiais.
ru: Имя пользователя не может содержать пробелов и специальных символов.
tr: Kullanıcı adı boşluk, özel karakterler içeremez.
zh: 用户名不能包含空格和特殊字符。
